In [116]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import re

In [117]:
customers=pd.read_excel('creditcardmarketing.xlsx').drop('Customer Number',axis=1)
cols_std=[i.replace(' ','_').lower() for i in customers.columns]
customers.rename(columns=dict(zip(customers.columns,cols_std)),inplace=True)

In [118]:
customers.isna().sum()

offer_accepted           0
reward                   0
mailer_type              0
income_level             0
#_bank_accounts_open     0
overdraft_protection     0
credit_rating            0
#_credit_cards_held      0
#_homes_owned            0
household_size           0
own_your_home            0
average_balance         24
q1_balance              24
q2_balance              24
q3_balance              24
q4_balance              24
dtype: int64

In [119]:
customers.drop(customers[customers['average_balance'].isna()].index,axis=0,inplace=True)

In [316]:
for i in customers.columns[1:-1]:
    customers.groupby(i)['offer_accepted'].value_counts().to_frame().div(customers.groupby(i).agg('count')['offer_accepted'].to_frame(),level=i)*100,1).rename(columns={'offer_accepted':'count'}).sort_values('count',ascending=False)

                          count
reward    offer_accepted
Cash Back No               96.6
Points    No               94.1
Air Miles No               92.3
          Yes               7.7
Points    Yes               5.9
Cash Back Yes               3.4

                          offer_accepted
reward    offer_accepted
Air Miles No                        5584
          Yes                        463
Cash Back No                        5789
          Yes                        206
Points    No                        5582
          Yes                        352

                            count
mailer_type offer_accepted
Letter      No               96.6
Postcard    No               92.1
            Yes               7.9
Letter      Yes               3.4

                            offer_accepted
mailer_type offer_accepted
Letter      No                        8542
            Yes                        300
Postcard    No                        8413
            Yes                        721

                             count
income_level offer_accepted
High         No               96.3
Medium       No               94.8
Low          No               91.3
             Yes               8.7
Medium       Yes               5.2
High         Yes               3.7

                             offer_accepted
income_level offer_accepted
High         No                        4354
             Yes                        165
Low          No                        4068
             Yes                        387
Medium       No                        8533
             Yes                        469

                                     count
#_bank_accounts_open offer_accepted
3                    No               95.9
1                    No               94.3
2                    No               94.2
                     Yes               5.8
1                    Yes               5.7
3                    Yes               4.1

                                     offer_accepted
#_bank_accounts_open offer_accepted
1                    No                       12899
                     Yes                        775
2                    No                        3773
                     Yes                        234
3                    No                         283
                     Yes                         12

                                     count
overdraft_protection offer_accepted
Yes                  No               94.5
No                   No               94.3
                     Yes               5.7
Yes                  Yes               5.5

                                     offer_accepted
overdraft_protection offer_accepted
No                   No                       14427
                     Yes                        873
Yes                  No                        2528
                     Yes                        148

                              count
credit_rating offer_accepted
High          No               98.0
Medium        No               95.5
Low           No               89.4
              Yes              10.6
Medium        Yes               4.5
High          Yes               2.0

                              offer_accepted
credit_rating offer_accepted
High          No                        5945
              Yes                        119
Low           No                        5315
              Yes                        633
Medium        No                        5695
              Yes                        269

                                    count
#_credit_cards_held offer_accepted
2                   No               94.5
4                   No               94.4
1                   No               94.1
3                   No               94.1
1                   Yes               5.9
3                   Yes               5.9
4                   Yes               5.6
2                   Yes               5.5

                                    offer_accepted
#_credit_cards_held offer_accepted
1                   No                        5786
                    Yes                        361
2                   No                        7500
                    Yes                        433
3                   No                        3183
                    Yes                        198
4                   No                         486
                    Yes                         29

                              count
#_homes_owned offer_accepted
3             No               95.1
1             No               94.3
2             No               94.3
1             Yes               5.7
2             Yes               5.7
3             Yes               4.9

                              offer_accepted
#_homes_owned offer_accepted
1             No                       13679
              Yes                        823
2             No                        3100
              Yes                        189
3             No                         176
              Yes                          9

                               count
household_size offer_accepted
8              No              100.0
9              Yes             100.0
6              No               95.0
5              No               94.9
2              No               94.6
4              No               94.4
3              No               94.0
1              No               92.0
               Yes               8.0
3              Yes               6.0
4              Yes               5.6
2              Yes               5.4
5              Yes               5.1
6              Yes               5.0

                               offer_accepted
household_size offer_accepted
1              No                         496
               Yes                         43
2              No                        2658
               Yes                        151
3              No                        5361
               Yes                        344
4              No                        5222
               Yes                        310
5              No                        2706
               Yes                        145
6              No                         511
               Yes                         27
8              No                           1
9              Yes                          1

                              count
own_your_home offer_accepted
No            No               94.3
Yes           No               94.3
No            Yes               5.7
Yes           Yes               5.7

                              offer_accepted
own_your_home offer_accepted
No            No                        5980
              Yes                        360
Yes           No                       10975
              Yes                        661

                                count
average_balance offer_accepted
48.25           No              100.0
1129.50         No              100.0
1132.00         No              100.0
1131.75         No              100.0
1131.00         No              100.0
...                               ...
1070.00         Yes               6.2
1033.00         Yes               6.2
1053.50         Yes               6.2
1078.50         Yes               6.2
1127.00         Yes               5.9

[5548 rows x 1 columns]

                                offer_accepted
average_balance offer_accepted
48.25           No                           1
56.00           No                           1
62.00           No                           1
63.50           No                           1
71.25           No                           1
...                                        ...
2437.50         No                           1
2609.50         No                           1
2738.50         No                           1
2948.50         No                           1
3366.25         No                           1

[5548 rows x 1 columns]

                           count
q1_balance offer_accepted
0.0        No              100.0
1242.0     No              100.0
1240.0     No              100.0
1237.0     No              100.0
1236.0     No              100.0
...                          ...
658.0      Yes               4.8
480.0      Yes               4.8
557.0      Yes               4.8
823.0      Yes               4.5
675.0      Yes               4.3

[2944 rows x 1 columns]

                           offer_accepted
q1_balance offer_accepted
0.0        No                           5
1.0        No                          10
2.0        No                           9
           Yes                          1
3.0        No                           3
...                                   ...
2435.0     No                           1
2453.0     No                           1
2502.0     No                           1
2509.0     No                           1
3450.0     No                           1

[2944 rows x 1 columns]

                           count
q2_balance offer_accepted
0.0        No              100.0
1053.0     No              100.0
1075.0     No              100.0
1073.0     No              100.0
1065.0     No              100.0
...                          ...
993.0      Yes               4.3
1232.0     Yes               4.3
1132.0     Yes               4.2
1197.0     Yes               3.8
1060.0     Yes               3.3

[2728 rows x 1 columns]

                           offer_accepted
q2_balance offer_accepted
0.0        No                           1
1.0        No                           3
2.0        No                          10
3.0        No                           5
4.0        No                           5
...                                   ...
2445.0     No                           1
2918.0     No                           1
3214.0     No                           1
3240.0     No                           1
3421.0     No                           1

[2728 rows x 1 columns]

                           count
q3_balance offer_accepted
0.0        No              100.0
1319.0     No              100.0
1342.0     No              100.0
1340.0     No              100.0
1339.0     No              100.0
...                          ...
857.0      Yes               4.3
933.0      Yes               4.3
970.0      Yes               4.2
972.0      Yes               3.8
833.0      Yes               3.7

[3071 rows x 1 columns]

                           offer_accepted
q3_balance offer_accepted
0.0        No                           1
1.0        No                           5
2.0        No                           3
3.0        No                           6
4.0        No                           9
...                                   ...
2761.0     No                           1
2802.0     No                           1
2945.0     No                           1
3016.0     No                           1
3823.0     No                           1

[3071 rows x 1 columns]

In [122]:
y=customers['offer_accepted']
X=customers.drop('offer_accepted',axis=1)
cols_std.remove(y.name)

In [123]:

X_num, X_cat=X._get_numeric_data(), X.select_dtypes('object')